0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [m^2 s^-2];

internalField   uniform 0.19; // Initial values determined by estimated average flow velocities, see report.

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet; // Inlet turbulent kinetic energy determined by velocity and turbulencce intensity
        intensity       0.05;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet; // Zero gradient for exiting flow, no incoming flow
        inletValue      $internalField;
        value           $internalField;
    }

    walls
    {
        type            zeroGradient; // Zero gradient far from propeller
    }

    hub
    {
    	type            kqRWallFunction; // Wall function at solid surface
        value           $internalField;
    }

    symY
    {
        type            cyclic;
    }

    symZ
    {
        type            cyclic;
    }

    /* symY
    {
        type            symmetryPlane;
    }

    symZ
    {
        type            symmetryPlane;
    } */
}


// ************************************************************************* //
