constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          900;
        startFace       1323377;
    }
    outlet
    {
        type            patch;
        nFaces          900;
        startFace       1324277;
    }
    walls
    {
        type            patch;
        nFaces          10800;
        startFace       1325177;
    }
    symY
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          13950;
        startFace       1335977;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  symZ;
    }
    symZ
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          13950;
        startFace       1349927;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  symY;
    }
    hub
    {
        type            wall;
        inGroups        1(wall);
        nFaces          500;
        startFace       1363877;
    }
)

// ************************************************************************* //
