system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//
// 3, 7                                 2, 6
// +-------------------------------------+
// |                                     |
// |                                     |
// |                                     |
// |                                     |
// |inlet                                |outlet
// |                                     |            y
// |                                     |            ^
// |           |                         |            |
// |           | rotor                   |            |
// +-----------|-------------------------+            ----->x
// 0, 4                                 1, 5
//

scale   1;

xmin   -1; // Distance from inlet to propeller
xmax    10; // Distance form propeller to outlet
ymin    0;
ymax    1; // Distance form centerline to outer wall is 1
zmin   -1; 
zmax    0;


vertices
(
    ($xmin  $ymin $zmin) // 0
    ($xmax  $ymin $zmin) // 1
    ($xmax  $ymax $zmin) // 2
    ($xmin  $ymax $zmin) // 3

    ($xmin  $ymin $zmax) // 4
    ($xmax  $ymin $zmax) // 5
    ($xmax  $ymax $zmax) // 6
    ($xmin  $ymax $zmax) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (180 30 30) simpleGrading (3 1 1) // Block mesh with 180 cells in x direction, 30 in transverse directions. length of cell in x-direction increases geometrically in the x-direction such that cells at the outlet are three times longer than at the inlet.
);

boundary
(
    inlet
    {
        type patch;
        faces  ((0 3 7 4));
    }

    outlet
    {
        type patch;
        faces ((1 5 6 2));
    }

    walls // Outer edge of flow domain
    {
        type patch;
        faces (
            (0 1 2 3)
            (2 6 7 3)   
        );
    }

    symY // Cyclic symmetry patches
    {
        type cyclic;
        faces ((0 4 5 1));
        neighbourPatch symZ;
    }

    symZ
    {
        type cyclic;
        faces ((4 7 6 5));
        neighbourPatch symY;
    }
);

// ************************************************************************* //
