system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "libactuatorDiskForce.so" // Required to make custom class available
);

application     simpleFoam; // Steady-state, incompressible simulations. Can be changed to e.g. pimpleFoam for transient simulations

startFrom       latestTime;

startTime       0;

stopAt          endTime;
    
endTime         3000; // Run 3000 iterations of the SIMPLE algorithm

deltaT          1;

writeControl    adjustable;

writeInterval   200; // Write field values to a file every 200 iterations

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable true; // Enables changes to simulation settings while it is running

adjustTimeStep  no;

//maxCo           1;

// ************************************************************************* //
