system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-07; // stopping criterion for matrix solving
        relTol          0.001; // Alternatively, stop if residual is less than 0.001 times initial residual
        smoother        GaussSeidel;
    }


    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0.001;
    }

}

SIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
    consistent      yes;

    residualControl
    {
        U                   1e-4; // End simulation if residuals for all variables are below 1e-4
        p                   1e-4;
        "(k|epsilon|omega)" 1e-4;
    }
}

relaxationFactors
{
    equations
    {
        "U.*"           0.7; // Weight of new field value compared to old: U_{n+1} = 0.7*U_{n, solved} + 0.3*U_n
        "k.*"           0.4;
        "epsilon.*"     0.4;
        p               0.25;
    }
}

// ************************************************************************* //
